In [2]:
import pandas as pd

In [4]:
data1=pd.DataFrame([
    [1,2,3,4],
    [5,6,7,8],
    [9,10,11,12]
                   ])
data1#初始化

   0   1   2   3
0  1   2   3   4
1  5   6   7   8
2  9  10  11  12

In [10]:
data1.apply(lambda x:x.max())

0     9
1    10
2    11
3    12
dtype: int64

In [13]:
data1.apply(lambda x:x.max(),axis=1)

0     4
1     8
2    12
dtype: int64

In [25]:
data1.index=["a","b","c"]
data1
data1.columns=["id","name","age","address"]
data1
data1["id"]=data1["name"]-data1["age"]
data1

   id  name  age  address
a  -1     2    3        4
b  -1     6    7        8
c  -1    10   11       12

In [32]:
data1.loc["a"]=data1.loc["b"]-data1.loc["c"]
data1
#行相减

   id  name  age  address
a   0    -4   -4       -4
b  -1     6    7        8
c  -1    10   11       12

In [40]:
def sum_all(series):
     return series.max()
data2=data1.apply(sum_all,axis=1)
data2

a     0
b     8
c    12
dtype: int64